export default {
  meta: {
    logo: 'Склоресурс',
    title: 'Склоресурс – ваш надійний партнер у світі скла.',
    error: {
      data: 'Помилка завантаження даних',
      '404': 'Сторінку не знайдено',
    },
    filters: {
      title: 'Фільтри',
      search: 'Пошук...',
      reset: 'Скинути',
    },
  },
  navbar: {
    menu: {
      services: 'Сервіси',
      posts: 'Статті',
      home: 'Головна',
      components: {
        title: 'Компоненти',
        description: 'Вибір ідеальних компонентів для вашого проекту',
      },
      delivery: {
        title: 'Доставка',
        description: 'Інформація про швидку та безпечну доставку',
      },
      news: {
        title: 'Новини',
        description: 'Статті та новини в одному місці',
      },
      projects: {
        title: 'Проєкти',
        description: 'Галерея успішних проектів',
      },
      reportings: {
        title: 'Звіти',
        description: 'Докладні аналізи та звіти',
      },
      seminars: {
        title: 'Семінари',
        description: 'Інформація про навчальні семінари',
      },
      vacancies: {
        title: 'Вакансії',
        description: 'Актуальні вакансії в нашій компанії',
      },
      production: {
        title: 'Виробництво',
        description: 'Відео про процес виробництва',
      },
      catalog: {
        title: 'Каталог',
        description:
          'Відкрийте наш каталог скла та знайдіть ідеальні рішення для вашого проекту',
      },
      'contact-us': {
        title: 'Зворотній зв’язок',
        description: "Зв'яжіться з нами через форму зворотнього зв'язку",
      },
    },
  },
  footer: {
    contact: {
      title: 'Контакти',
      telephone: 'Телефон',
    },
    address: {
      title: 'Адреса',
      p1: 'Україна',
      p2: 'м. Дубно',
      p3: 'вул. Семидубська, 105',
    },
  },
  home: {
    meta: {
      description:
        "Склоресурс - провідні виробники скла для екстер'єрного та інтер'єрного скління, надають широкий асортимент продукції для вашого проекту.",
    },
    hero: {
      slogan: 'Професійсність. Прозорість. Іноваційність.',
      main: {
        title: 'Склоресурс',
        'sub-title':
          'Сучасне виробництво обробки скла згідно європейських стандартів',
        'learn-more':
          'Компанія "Склоресурс" - це 17 років досвіду в галузі архітектурного та інтер’єрного скління.',
      },
      target: {
        title: 'Місія компанії',
        content:
          'Сучасні технології обробки скла для реалізації ваших мрій. Дивіться на світ із задоволенням!',
      },
    },
    target: {
      location: 'Два виробничих майданчика',
      area: 'Загальна виробнича площа 17 600м²',
      employees: 'Більше 300 працівників',
      products: 'Більше 50 000м² виробів на місяць',
      types: 'Понад 60 видів скла на складі',
      projects: 'Більше 200 проєктів щороку',
    },
    certificates: {
      title:
        'Якість виробів нашої компанії перевірено німецьким інститутом IFT Rosenheim',
    },
    productions: {
      title: 'Виробництво',
    },
    news: {
      title: 'Новини',
      button: 'Всі новини',
      'read-more': 'Читати повністю',
    },
    projects: {
      title: 'Проєкти',
      description:
        'За роки досвіду в галузі обробки скла, ми успішно втілили ряд вражаючих ініціатив спільно з надійними партнерами. Дізнайтеся більше про наші проекти, які не лише змінюють обличчя сучасного скління, а й сприяють збереженню навколишнього середовища.',
      button: 'Всі проєкти',
    },
    'contact-us': {
      title: { default: 'Будемо на ', primary: "зв'язку" },
      telephone: 'Телефон',
      form: {
        username: {
          placeholder: "Ваше ім'я*",
        },
        email: {
          placeholder: 'Ваш email*',
        },
        phone: {
          placeholder: 'Номер телефону',
        },
        message: {
          placeholder: 'Повідомлення*',
        },
        additional: {
          placeholder: 'Як ви про нас дізнались?',
        },
        'submit-button': {
          default: 'Відправити',
          loading: 'Відправлення...',
        },
        'alert-button': 'Закрити',
        alerts: {
          successfully: {
            title: 'Успішно',
            description: 'Ваше повідомлення успішно відправлено',
          },
          error: {
            title: 'Помилка',
            description: 'Помилка при відправці вашого повідомлення',
          },
          captcha: {
            title: 'Помилка',
            description: 'Помилка проходження reCaptcha',
          },
        },
      },
    },
  },
  components: {
    title: 'Комплектуючі для обробки скла',
    description:
      'Найбільший вибір комплектуючих для обробки скла. Знайдіть ідеальні рішення для вашого проекту. Висока якість та надійність. Перегляньте наш каталог комплектуючих прямо зараз.',
    none: 'Не знайдено жодного компоненту',
    categories: {
      title: 'Категорії',
      all: 'Всі категорії',
    },
    'go-to': 'Перейти',
  },
  delivery: {
    title: "Доставка продукції на об'єкт",
    description:
      'Доставка, що задовольняє ваші потреби. Ми пропонуємо широкий спектр варіантів доставки, щоб забезпечити зручність для наших клієнтів. Дізнайтеся більше про наші умови доставки, терміни та вартість, щоб зробити покупки у нас ще приємнішими. Заощадьте час та зусилля з нашою інформацією про доставку.',
  },
  news: {
    title: 'Новини',
    description:
      'Слідкуйте за останніми статтями та новинами у світі обробки скла. Наш блог пропонує цікаву і актуальну інформацію, поради та інсайти, що стосуються галузі обробки скла. Відкрийте для себе останні тренди, технологічні новини та багато іншого. Будьте завжди в курсі з нашими статтями та новинами.',
  },
  projects: {
    title: 'Проєкти',
    description:
      'Перегляньте нашу галерею проектів і надихніться неймовірною красою та інноваціями у світі обробки скла. Дізнайтеся більше про наші проекти та вражаючі досягнення. Наша галерея є джерелом натхнення для майстрів та фахівців галузі. Перегляньте наші роботи та дізнайтеся, як ми реалізуємо найкращі ідеї в реальному житті.',
    none: 'Не знайдено жодного проєкту',
    show: 'Показано: ',
    filters: {
      location: {
        title: 'Локації',
        all: 'Всі локації',
      },
      glass: {
        title: 'Тип скла',
        all: 'Всі типи скла',
      },
      year: {
        title: 'Рік',
      },
    },
  },
  reportings: {
    title: 'Звіти',
    description:
      'Отримайте фінансові та аудиторські звіти для глибшого розуміння нашої компанії. Довіряйте надійній інформації про нашу фінансову стійкість та діяльність.',
    year: 'рік',
    auditory: 'Ауторський звіт',
    finance: 'Фінансовий звіт',
  },
  seminars: {
    title: 'Семінари',
    description:
      'Дізнайтеся більше про наші семінари. Отримуйте цінні знання та інсайти в сфері обробки скла на наших заходах. Відкрийте для себе найновіші тенденції та навички нашої галузі.',
  },
  vacancies: {
    title: 'Вакансії',
    description:
      'Ознайомтесь із нашими актуальними вакансіями. Знайдіть можливість приєднатися до нашої команди та вкласти свої навички у сферу обробки скла. Разом ми розвиваємо інновації та досягаємо успіхів.',
    'detailed-button': 'Детальніше',
  },
  catalog: {
    title: 'Каталог',
    description:
      'Проведіть екскурсію в нашому каталозі продукції. Вибирайте з різноманітного асортименту скла. Наш каталог пропонує якість і інновації для вас. Знайдіть найкращі рішення для ваших потреб прямо тут.',
    exterior: "Екстер'єр",
    interior: "Інтер'єр",
  },
} as const;
