export default {
  meta: {
    logo: 'Склоресурс',
    title: 'Склоресурс – ваш надійний партнер у світі скла.',
    error: {
      data: 'Помилка завантаження даних',
      '404': 'Сторінку не знайдено',
    },
    filters: {
      title: 'Фільтри',
      search: 'Пошук...',
      reset: 'Скинути',
    },
  },
  navbar: {
    menu: {
      services: 'Сервіси',
      posts: 'Статті',
      home: 'Головна',
      components: {
        title: 'Комплектуючі для обробки скла',
        description: 'Вибір комплектуючих для обробки скла',
      },
      delivery: {
        title: 'Доставка',
        description: 'Інформація про доставку',
      },
      news: {
        title: 'Новини',
        description: 'Статті та новини',
      },
      projects: {
        title: 'Проєкти',
        description: 'Галерея реалізованих проектів',
      },
      reportings: {
        title: 'Звіти',
        description: 'Аналізи та звіти',
      },
      seminars: {
        title: 'Семінари',
        description: 'Інформація про навчальні семінари',
      },
      vacancies: {
        title: 'Вакансії',
        description: 'Актуальні вакансії в нашій компанії',
      },
      production: {
        title: 'Виробництво',
        description: 'Відео виробництва',
      },
      catalog: {
        title: 'Каталог',
        description:
          'Відкрийте наш каталог продукції та знайдіть ідеальні рішення для вашого проєкту',
      },
      'contact-us': {
        title: 'Зворотній зв’язок',
        description: "Зв'яжіться з нами через форму зворотнього зв'язку",
      },
    },
  },
  footer: {
    contact: {
      title: 'Контакти',
      telephone: 'Телефон',
    },
    address: {
      title: 'Адреса',
      p1: 'Україна',
      p2: 'м. Дубно',
      p3: 'вул. Семидубська, 105',
    },
  },
  home: {
    meta: {
      description:
        'Склоресурс - сучасне виробництво по обробці скла згідно європейських стандартів.',
    },
    hero: {
      slogan: 'Професійсність. Прозорість. Іноваційність.',
      main: {
        title: 'Склоресурс',
        'sub-title':
          'Сучасне виробництво обробки скла згідно європейських стандартів',
        'learn-more':
          'Компанія "Склоресурс" - це 17 років досвіду в галузі архітектурного та інтер’єрного скління.',
      },
      target: {
        title: 'Місія компанії',
        content:
          'Сучасні технології обробки скла для реалізації ваших мрій. Дивіться на світ із задоволенням!',
      },
    },
    target: {
      location: 'Два виробничих майданчика',
      area: 'Загальна виробнича площа 17 600 м²',
      employees: 'Більше 300 працівників',
      products: 'Більше 50 000 м² виробів на місяць',
      types: 'Понад 60 видів скла на складі',
      projects: 'Більше 200 проєктів щороку',
    },
    certificates: {
      title:
        'Якість виробів нашої компанії перевірено німецьким інститутом IFT Rosenheim',
    },
    quality: {
      title: 'Довідник з якості',
      description:
        'У Довіднику визначені допуски та відхилення основних параметрів нашої продукції. Довідник базується на вказаних тут стандартах, а також можливостях сучасного обладнання.',
      button: 'Переглянути',
    },
    news: {
      title: 'Новини',
      button: 'Всі новини',
      'read-more': 'Читати повністю',
    },
    projects: {
      title: 'Проєкти',
      description:
        "За роки досвіду в галузі обробки скла, ми успішно втілили ряд вражаючих проєктів спільно з надійними партнерами. Дізнайтеся більше про наші об'єкти, які не лише трансформують обличчя сучасного скління, але й сприяють збереженню навколишнього середовища",
      button: 'Всі проєкти',
    },
    'contact-us': {
      title: { default: 'Будемо на ', primary: "зв'язку" },
      telephone: 'Телефон',
      form: {
        username: {
          placeholder: "Ваше ім'я*",
        },
        email: {
          placeholder: 'Ваш email*',
        },
        phone: {
          placeholder: 'Номер телефону',
        },
        message: {
          placeholder: 'Повідомлення*',
        },
        additional: {
          placeholder: 'Як ви про нас дізнались?',
        },
        'submit-button': {
          default: 'Відправити',
          loading: 'Відправлення...',
        },
        'alert-button': 'Закрити',
        alerts: {
          successfully: {
            title: 'Успішно',
            description: 'Ваше повідомлення успішно відправлено',
          },
          error: {
            title: 'Помилка',
            description: 'Помилка при відправці вашого повідомлення',
          },
          captcha: {
            title: 'Помилка',
            description: 'Помилка проходження reCaptcha',
          },
        },
      },
    },
  },
  components: {
    title: 'Комплектуючі для обробки скла',
    description:
      'Найбільший вибір комплектуючих для обробки скла. Знайдіть ідеальні рішення для вашого проекту. Висока якість та надійність. Перегляньте наш каталог комплектуючих прямо зараз.',
    none: 'Не знайдено жодного компоненту',
    categories: {
      title: 'Категорії',
      all: 'Всі категорії',
    },
    'go-to': 'Перейти',
  },
  delivery: {
    title: "Доставка продукції на об'єкт",
    description:
      'Доставка, що задовольняє ваші потреби. Безпечне завантаження та розвантаження склопакетів будь-яких розмірів і ваги. Дізнайтеся більше про наші умови доставки.',
  },
  news: {
    title: 'Новини',
    'return-back': 'Повернутися назад',
    description:
      'Приєднуйтесь до нас та будьте в курсі останніх статей та новин в галузі обробки скла. Цікаві та актуальні матеріали, найновіші технологічні досягнення та багато іншого.',
  },
  projects: {
    title: 'Проєкти',
    description:
      'Запрошуємо вас переглянути нашу галерею проектів та знайти натхнення в світі обробки скла. Дізнайтеся більше про наші проекти та інновації, які надихають фахівців галузі.',
    none: 'Не знайдено жодного проєкту',
    show: 'Показано: ',
    filters: {
      location: {
        title: 'Локації',
        all: 'Всі локації',
      },
      glass: {
        title: 'Тип скла',
        all: 'Всі типи скла',
      },
      year: {
        title: 'Рік',
      },
    },
  },
  reportings: {
    title: 'Звіти',
    description:
      'Отримайте фінансові та аудиторські звіти для глибшого розуміння нашої компанії. Довіряйте надійній інформації про нашу фінансову стійкість та діяльність.',
    year: 'рік',
    auditory: 'Ауторський звіт',
    finance: 'Фінансовий звіт',
  },
  seminars: {
    title: 'Семінари',
    description:
      'Дізнайтеся більше про наші семінари. Отримуйте цінні знання та інсайти в сфері обробки скла та відкрийте для себе нові тенденції та навички нашої галузі.',
  },
  vacancies: {
    title: 'Вакансії',
    'return-back': 'Повернутися назад',
    description:
      'Дізнайтесь про наші актуальні вакансії та відкрийте можливість приєднатися до нашої команди.',
    'detailed-button': 'Детальніше',
  },
  catalog: {
    title: 'Каталог',
    description:
      'Відкрийте наш каталог, щоб ознайомитися з асортиментом продукції для створення унікальних дизайнерських рішень.',
    exterior: "Екстер'єр",
    interior: "Інтер'єр",
  },
} as const;
